START_MESSAGE = 'Я являюсь ботом PRIDE CONNECT - Нетворкинг для предпринимателей и частных специалистов от  Pride Community.💣\n\n\
В этом боте вы можете: \n\
 ⁃ Закрыть задачи по коллаборациям, необходимые связи для масштабирования своих проектов или личных брендов, партнера в проекты, подрядчиков, а может настоящего друга ⚡️\n\n\
Каждую неделю я буду предлагать \
Вам для встречи интересного человека, выбранного среди других участников нашего Нетворкинг коммьюнити, исходящих критериев вашей анкеты или запроса!\n\n\
Чтобы принимать участие в встречах необходимо заполнить анкету и мы предложим вам собеседника🔥'

DESCRIBE_WORK = 'Сейчас расскажем как работает бот Pride Connect 🤝🏽'

GET_NAME = '🎯1/13\n\n\
Напиши свое имя и фамилию?'

GET_USER_NAME = 'В вашем аккаунте телеграм не установлен юзернэйм(@username).\n\nУстановите его пожалуйста, перейдя в Настройки -> Аккаунт -> Имя пользователя\n\n\
Это нужно сделать для того, чтобы вы могли без проблем общаться со своей парой!'

GET_TOWN = '🎯2/13\n\n\
💣Откуда ты? Напиши название города ответом на это сообщение 🤝🏽\n\n\
✅ Москва, Ростов-на-Дону, Екатеринбург\n\
❌ МСК , Ростов, Екб\n\n\
Мы будем назначать тебе встречи с собеседником выбранным по критериям заполненной тобой анкеты. \
С назначенным нетворкером, вы можете оказаться в разных городах, тогда вам подойдет online формат встречи ⚡️\n\n\
А если же Вы из одного города, то рекомендуем договориться на offline формат, но решение за вами 🙌🏽'

GET_SOCIAL = '🎯3/13\n\n\
Напиши какой у тебя номер телефона? '

GET_WORK = '🎯4/13\n\n\
Из какой ты ниши? Чем занимаешься? '

GET_COMPANY = '🎯5/13\n\n\
Как называется компания? '

GET_HOBBY = '🎯6/13\n\n\
Расскажи о сферах твоего интереса, чем увлекаешься как в личном, так и в профессиональном плане?🙌🏽'

GET_EXPECT = '🎯7/13\n\n\
Выберите соотношение фана и пользы от встречи'

GET_FORMAT = '🎯8/13\n\nВыберите формат встреч'

GET_DATA = '🎯9/13\n\n\
📅 Напиши дату своего рождения в формате дд.мм.гггг.'

CHOOSE_FORMAT = '🎯10/13\n\n\
⚡️Для каких запросов используют бот для нетворкинга Pride Connect?\n\n\
 ⁃ Найти новые связи для решения задач по проектам\n\
 ⁃ Создать коллаборации и партнерства\n\
 ⁃ Найти подрядчиков в разных нишах\n\
 ⁃ Познакомиться с интересными людьми со схожими интересами\n\
 ⁃ Расширить свои возможности и влияние\n\n\
Наш главный оффер нетворкеров - Связи решают ВСЕ и даже больше 💣\n\n\
За каким сейчас вариантом здесь ты? '

CHOOSE_GENDER = '🎯11/13\n\n\
Ты М или Ж?\
Выбери свой вариант⬇️'



ASK_CHANGE = 'Выберите пункт, который хотите поменять : '

SUCCSES_CHANGE = 'Параметр успешно изменён\nВыберите пункт, который хотите поменять : '

ABOUT_SUB = '🎯13/13\n\n\
Чтобы начать свои первые встречи, нужно активировать подписку, это займёт пару нажатий ➡️\n\n\
Pride Connect организовало уже более 500 оффлайн и  8000 онлайн встреч, через нашу платформу.\n\
Самые интересные и эффективные встречи  – в коммьюнити Pride Connect. Присоединяйся😉'

ABOUT_UNIC_PROMO = 'Вы ввели уникальный промокод, ваша подписка продлена на месяц!👌'

HELP_MESSAGE = 'Этот бот поможет вам найти людей для общения или сотрудничества 💼\n\n\
Пары для общения подбираются с учётом ваших общих интересов.\n\
Распределение пар происходит по понедельникам, но вы также можете получить дополнительную пару \
нажав в Главном меню кнопку Доп пара. Количество партнёров в неделю - не более 2.\n\
Отслеживать историю ваших встреч можно в Главном меню в пункте История.\n\n\
Формат встреч:\n\
-вживую - постараемся подобрать пару из вашего города\n\
-онлайн - подберём партнёра для переписки или видеосвязи\n\n\
Вы можете изменить свой профиль в Главном меню в пункте Отредактировать либо же заполнить анкету \
заново, введя /restart. Данные о вашей оплате никуда не пропадут.\n\n\
В воскресенье мы спросим вас о готовности участвовать на следующей неделе, можете проигнорировать данное \
сообщение, если не хотите изменять состояние с прошлой недели.\n\n\
Если у вас остались вопросы или возникла проблема с использованием бота - напишите нашему администратору https://t.me/baribeshnik'


TEXT_PROFILE = '🎯12/13\n\n\
Спасибо, теперь ознакомимся с твоей анкетой⚡️\n\n\
Так будет выглядеть твой аккаунт в сообщении, которое мы направим твоему собеседнику.\n⬇️\n'

MENU = 'Главное меню PRIDE CONNECT'